<html>
<head>
<title>Boite de dialogue : Premier point et fréquence d'enregistrement des courbes de densitométrie</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" href="/Dialogs/html/helpstyle.css" type="text/css">
</head>

<body bgcolor="#FFFFFF" text="#000000">
<h2>Premier point et fr&eacute;quence d'enregistrement des courbes de densitom&eacute;trie</h2>
<p>Cette boite de dialogue permet de d&eacute;finir les points de la courbe de 
  densitom&eacute;trie qui seront enregistr&eacute;s dans le fichier d'export.</p>
<h3>Type d'affichage</h3>
<p>Il est possible de faire apparaitre dans le fichier de sortie soit la valeur 
  d'abscisse des points calcul&eacute;s soit leur valeur d'ordonn&eacute;e, soit 
  les deux. Lorsque le segment analys&eacute; est parall&egrave;le &agrave; l'axe 
  des abscisses, seules les valeurs d'abscisses sont affichables. Il en est de 
  m&ecirc;me lorsque le segment est parall&egrave;le &agrave; l'axe des ordonn&eacute;es 
  (l'autre coordonn&eacute;e est constante).</p>
<h3>Premier point enregistr&eacute;</h3>
<p>Initialement, le premier point &agrave; enregistrer est le point du segment 
  qui a l'abscisse la plus faible. </p>
<p>Ce premier point doit appartenir au segment qui a &eacute;t&eacute; trac&eacute; 
  et dont les coordonn&eacute;es minimales et maximales sont affich&eacute;es 
  dans la boite de dialogue. </p>
<p>Les valeurs de x et de y sont li&eacute;es entre elles puisque ce point appartient 
  au segment : le fait de modifier son abscisse modifie automatiquement son ordonn&eacute;e 
  et inversement.</p>
<h3>Fr&eacute;quence et p&eacute;riode d'enregistrement</h3>
<p>Vous pouvez exprimer la fr&eacute;quence des points &agrave; enregistrer soit 
  selon les abscisses soit selon les ordonn&eacute;es. Une fr&eacute;quence (ou 
  p&eacute;riode) n&eacute;gative est autoris&eacute;e.</p>
<p>Tout comme pour le premier point, le fait de modifier la fr&eacute;quence selon 
  X modifie automatiquement celle selon Y.</p>
<p>Lorsqu'un axe est logarithmique, la p&eacute;riode est exprim&eacute;e en d&eacute;cade 
  d'unit&eacute;.</p>
<p>&nbsp;</p>
<p>Le nombre total de points qui seront enregistr&eacute;s est affich&eacute; 
  dans le bas de la boite de dialogue.</p>
<p>&nbsp;</p>
</body>
</html>
