<html>

<head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
<meta http-equiv="Content-Language" content="fr">
<title>Boite de dialogue : courbe spline</title>
<link rel="stylesheet" href="/Dialogs/html/helpstyle.css" type="text/css">
</head>

<body>
<h2>Courbe spline</h2>
<p>Les courbes splines permettent de num&eacute;riser des graphiques tr&egrave;s 
  facilement, en tracant des courbes comme dans un logiciel de dessin vectoriel. 
  Ces courbes sont constitu&eacute;es de points fixes et de points de tangentes. 
  L'ensemble de ces points sont appel&eacute;s points d'ancrage.</p>
<p><img src="../images/Spline1.gif" width="616" height="440"></p>
<p>La cr&eacute;ation et la modification des courbes splines se fait par les biais 
  de 5 modes diff&eacute;rents :</p>
<ul>
  <li>Ajout de points en fin de courbe (s&eacute;lectionn&eacute; par d&eacute;faut)</li>
  <li>Ajout de points en d&eacute;but de courbe</li>
  <li>Ajout de point en milieu de courbe</li>
  <li>Suppression de points</li>
  <li>Modification de points</li>
</ul>
<h3>Ajout de points en fin de courbe</h3>
<p>Dans ce mode, des points fixes sont cr&eacute;&eacute;s &agrave; l'endroit 
  o&ugrave; est enfonc&eacute; le bouton gauche de la souris. Les points de tangente 
  qui leur sont associ&eacute;s sont cr&eacute;&eacute;s &agrave; l'endroit ou 
  le bouton de la souris est relach&eacute;. Lorsque le point de tangence est 
  en cours de placement, son double est plac&eacute; sym&eacute;triquement par 
  rapport au point fixe. Si la touche Ctrl est enfonc&eacute;e, les deux points 
  de tangence sont d&eacute;solidaris&eacute;s. Ceci permet de cr&eacute;er des 
  angles aux points fixes. La touche Majuscule permet de les solidariser &agrave; 
  nouveau, et donc de lisser les angles. Chaque nouveau point est cr&eacute;&eacute; 
  en fin de courbe.</p>
<h3>Ajout de points en d&eacute;but de courbe</h3>
<p>Ce mode est identique au pr&eacute;c&eacute;dent. Les nouveaux points sont 
  cr&eacute;&eacute;s &agrave; l'autre extr&eacute;mit&eacute; de la courbe.</p>
<h3>Ajout de point en milieu de courbe</h3>
<p>Grace &agrave; ce mode, il est possible d'ajouter des points au milieu d'une 
  courbe d&eacute;j&agrave; existante. Les points de tangente sont ajust&eacute;s 
  afin que le chemin de la courbe ne soit pas modifi&eacute;. Une fois le point 
  cr&eacute;&eacute;, le mode &quot;modification&quot; est automatiquement activ&eacute;.</p>
<h3>Suppression de points</h3>
<p>Ce mode permet de supprimer les points cr&eacute;&eacute;s pr&eacute;c&eacute;demment.</p>
<h3>Modification</h3>
<p>Permet de d&eacute;placer les points d'ancrage.</p>
</body>

</html>
